app/controllers/api/posts_controller.rb

  def create
    render json: @current_user.posts.create(post_params)
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hi"], ["content", "hi"], ["user_id", 3], ["created_at", "2015-09-22 04:05:05.567109"], ["updated_at", "2015-09-22 04:05:05.567109"]]

  def destroy
    @current_user.posts.destroy(params[:id])
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]