app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "skip1"], ["password", "123"], ["created_at", "2015-09-21 22:07:20.594156"], ["updated_at", "2015-09-21 22:07:20.594156"]]
---
  def create
    user = User.create(user_params)